Titanic Survivor Model, v1
Mickey Whittaker
6/11/25

Read CSV data

In [32]:
import pandas as pd

train = pd.read_csv('train.csv')
test  = pd.read_csv('test.csv')
print(train.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

Drop Name and Ticket columns, not valuable to my understanding

In [33]:
cleaning = train.drop(['Name','Ticket'], axis=1)

Replace Sex with binary is_male 1 (yes) or female (0)

In [34]:
cleaning['is_male'] = cleaning['Sex'].replace({'male':1, 'female': 0})
cleaning.head()

C:\Users\MWOfficeDesktop\AppData\Local\Temp\ipykernel_42868\1071466452.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  cleaning['is_male'] = cleaning['Sex'].replace({'male':1, 'female': 0})

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,is_male
0,1,0,3,male,22.0,1,0,7.2500,NaN,S,1
1,2,1,1,female,38.0,1,0,71.2833,C85,C,0
2,3,1,3,female,26.0,0,0,7.9250,NaN,S,0
3,4,1,1,female,35.0,1,0,53.1000,C123,S,0
4,5,0,3,male,35.0,0,0,8.0500,NaN,S,1

drop old 'Sex' column

In [35]:
cleaning.drop('Sex', axis=1, inplace=True)
print(cleaning.head())

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare Cabin Embarked  \
0            1         0       3  22.0      1      0   7.2500   NaN        S
1            2         1       1  38.0      1      0  71.2833   C85        C
2            3         1       3  26.0      0      0   7.9250   NaN        S
3            4         1       1  35.0      1      0  53.1000  C123        S
4            5         0       3  35.0      0      0   8.0500   NaN        S

   is_male
0        1
1        0
2        0
3        0
4        1

drop missing age rows from training model

In [36]:
cleaning['Age'] = cleaning['Age'].fillna(0)
cleaning = cleaning[cleaning['Age'] !=0]

In [37]:
cleaning['norm_age'] = (cleaning['Age'] - cleaning['Age'].min()) / (cleaning['Age'].max() - cleaning['Age'].min())
cleaning.head()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Cabin,Embarked,is_male,norm_age
0,1,0,3,22.0,1,0,7.2500,NaN,S,1,0.271174
1,2,1,1,38.0,1,0,71.2833,C85,C,0,0.472229
2,3,1,3,26.0,0,0,7.9250,NaN,S,0,0.321438
3,4,1,1,35.0,1,0,53.1000,C123,S,0,0.434531
4,5,0,3,35.0,0,0,8.0500,NaN,S,1,0.434531

In [38]:
cleaning.drop('Age', axis=1, inplace=True)
cleaning.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,is_male,norm_age
0,1,0,3,1,0,7.2500,NaN,S,1,0.271174
1,2,1,1,1,0,71.2833,C85,C,0,0.472229
2,3,1,3,0,0,7.9250,NaN,S,0,0.321438
3,4,1,1,1,0,53.1000,C123,S,0,0.434531
4,5,0,3,0,0,8.0500,NaN,S,1,0.434531

In [39]:
cleaning['emb_s'] = (cleaning['Embarked'] == 'S').astype(int)
cleaning['emb_c'] = (cleaning['Embarked'] == 'C').astype(int)
cleaning.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Cabin,Embarked,is_male,norm_age,emb_s,emb_c
0,1,0,3,1,0,7.2500,NaN,S,1,0.271174,1,0
1,2,1,1,1,0,71.2833,C85,C,0,0.472229,0,1
2,3,1,3,0,0,7.9250,NaN,S,0,0.321438,1,0
3,4,1,1,1,0,53.1000,C123,S,0,0.434531,1,0
4,5,0,3,0,0,8.0500,NaN,S,1,0.434531,1,0

In [40]:
cleaning.drop('Embarked', axis=1, inplace=True)

In [41]:
cleaning = pd.concat([cleaning, pd.get_dummies(cleaning['Pclass'], prefix='Pclass')], axis=1)
cleaning.head()

,PassengerId,Survived,Pclass,SibSp,Parch,Fare,Cabin,is_male,norm_age,emb_s,emb_c,Pclass_1,Pclass_2,Pclass_3
0,1,0,3,1,0,7.2500,NaN,1,0.271174,1,0,False,False,True
1,2,1,1,1,0,71.2833,C85,0,0.472229,0,1,True,False,False
2,3,1,3,0,0,7.9250,NaN,0,0.321438,1,0,False,False,True
3,4,1,1,1,0,53.1000,C123,0,0.434531,1,0,True,False,False
4,5,0,3,0,0,8.0500,NaN,1,0.434531,1,0,False,False,True

Oops, need ints...

In [42]:
for col in ['Pclass_1','Pclass_2','Pclass_3']:
    cleaning[col] = cleaning[col].astype(int)

drop old pclass, and extra pclass_3 columns

In [ ]:
cleaning = cleaning.drop(['Pclass'], axis=1)
cleaning = cleaning.drop(['Pclass_3'], axis=1)  
cleaning.head()

,PassengerId,Survived,SibSp,Parch,Fare,Cabin,is_male,norm_age,emb_s,emb_c,Pclass_1,Pclass_2
0,1,0,1,0,7.2500,NaN,1,0.271174,1,0,0,0
1,2,1,1,0,71.2833,C85,0,0.472229,0,1,1,0
2,3,1,0,0,7.9250,NaN,0,0.321438,1,0,0,0
3,4,1,1,0,53.1000,C123,0,0.434531,1,0,1,0
4,5,0,0,0,8.0500,NaN,1,0.434531,1,0,0,0

In [46]:
cleaning.to_csv('cleaned_train.csv', index=False)